---
kind: other
id: Methods.T:Autodesk.Revit.UI.SelectionUIOptions
source: html/af3e3b0d-6b87-5d2e-cdb6-4b41939800fe.htm
---
# SelectionUIOptions Methods

Checks whether the specified element will be treated as pinned for the purposes of selection.